#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.nc-custom-data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "nc-custom-data"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #!/bin/bash
            # Create systemd service unit file
            tee /etc/systemd/system/cloudoffice-ansible-state.service << EOM
            [Unit]
            Description=cloudoffice-ansible-state
            After=network.target
            
            [Service]
            ExecStart=/opt/cloudoffice-ansible-state.sh
            Type=simple
            Restart=on-failure   
            RestartSec=30
            
            [Install]
            WantedBy=multi-user.target
            EOM
            
            # Create systemd timer unit file
            tee /etc/systemd/system/cloudoffice-ansible-state.timer << EOM
            [Unit]
            Description=Starts cloudoffice ansible state playbook 1min after boot
            
            [Timer]
            OnBootSec=1min
            Unit=cloudoffice-ansible-state.service
            
            [Install]
            WantedBy=multi-user.target
            EOM
            
            # Create cloudoffice-ansible-state script
            tee /opt/cloudoffice-ansible-state.sh << EOM
            #!/bin/bash
            # Update package list
            apt-get update
            # Install pip3 and git
            DEBIAN_FRONTEND=noninteractive apt-get -y install python3-pip git
            pip3 install --upgrade pip
            # Install azure for ansible
            pip3 install ansible[azure]
            # And the collection
            ansible-galaxy collection install azure.azcollection
            # Grab the python requirements for azure
            rm -f requirements-azure.txt
            wget https://raw.githubusercontent.com/ansible-collections/azure/dev/requirements-azure.txt
            # Install the requirements
            pip3 install -r requirements-azure.txt
            # Make the project directory
            mkdir -p /opt/git/cloudoffice
            # Clone project into project directory
            git clone ${project_url} /opt/git/cloudoffice
            # Change to directory
            cd /opt/git/cloudoffice
            # Ensure up-to-date
            git pull
            # Change to playbooks directory
            cd playbooks/
            # Execute playbook
            ansible-playbook cloudoffice_azure.yml --extra-vars 'docker_network=${docker_network} docker_gw=${docker_gw} docker_nextcloud=${docker_nextcloud} docker_db=${docker_db} docker_webproxy=${docker_webproxy} docker_storagegw=${docker_storagegw} docker_onlyoffice=${docker_onlyoffice} nc_prefix=${nc_prefix} nc_suffix=${nc_suffix} instance_public_ip=${instance_public_ip} az_storage_account_name=${az_storage_account_name} web_port=${web_port} oo_port=${oo_port} project_directory=${project_directory} enable_duckdns=${enable_duckdns} duckdns_domain=${duckdns_domain} duckdns_token=${duckdns_token} letsencrypt_email=${letsencrypt_email} docker_duckdnsupdater=${docker_duckdnsupdater}' >> /var/log/cloudoffice.log
            EOM
            
            # Start / Enable cloudoffice-ansible-state
            chmod +x /opt/cloudoffice-ansible-state.sh
            systemctl daemon-reload
            systemctl start cloudoffice-ansible-state.timer
            systemctl start cloudoffice-ansible-state.service
            systemctl enable cloudoffice-ansible-state.timer
            systemctl enable cloudoffice-ansible-state.service
        EOT
      + vars     = {
          + "az_storage_account_name" = (known after apply)
          + "docker_db"               = "172.18.1.3"
          + "docker_duckdnsupdater"   = "172.18.1.7"
          + "docker_gw"               = "172.18.1.1"
          + "docker_network"          = "172.18.1.0"
          + "docker_nextcloud"        = "172.18.1.2"
          + "docker_onlyoffice"       = "172.18.1.6"
          + "docker_storagegw"        = "172.18.1.5"
          + "docker_webproxy"         = "172.18.1.4"
          + "duckdns_domain"          = (sensitive)
          + "duckdns_token"           = (sensitive)
          + "enable_duckdns"          = "1"
          + "instance_public_ip"      = (known after apply)
          + "letsencrypt_email"       = "jczuurmond@protonmail.com"
          + "nc_prefix"               = "nextcloud"
          + "nc_suffix"               = (known after apply)
          + "oo_port"                 = "8443"
          + "project_directory"       = "/opt"
          + "project_url"             = "https://github.com/JCZuurmond/cloudoffice"
          + "web_port"                = "443"
        }
    }

  # azurerm_disk_encryption_set.nc-disk-encrypt will be created
  + resource "azurerm_disk_encryption_set" "nc-disk-encrypt" {
      + id                  = (known after apply)
      + key_vault_key_id    = (known after apply)
      + location            = "westeurope"
      + name                = "nextcloud-disk-encrypt"
      + resource_group_name = "nextcloud-resourcegroup"

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_key_vault.nc-vault-disk will be created
  + resource "azurerm_key_vault" "nc-vault-disk" {
      + access_policy               = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "get",
                  + "create",
                  + "delete",
                  + "list",
                  + "restore",
                  + "recover",
                  + "unwrapkey",
                  + "wrapkey",
                  + "purge",
                  + "encrypt",
                  + "decrypt",
                  + "sign",
                  + "verify",
                ]
              + object_id               = "d6bb8ebd-cbb2-49e0-bc94-5be1e6ceb048"
              + secret_permissions      = null
              + storage_permissions     = null
              + tenant_id               = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
            },
        ]
      + enabled_for_disk_encryption = true
      + id                          = (known after apply)
      + location                    = "westeurope"
      + name                        = (known after apply)
      + purge_protection_enabled    = true
      + resource_group_name         = "nextcloud-resourcegroup"
      + sku_name                    = "standard"
      + soft_delete_enabled         = (known after apply)
      + soft_delete_retention_days  = 90
      + tenant_id                   = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
      + vault_uri                   = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault.nc-vault-secret will be created
  + resource "azurerm_key_vault" "nc-vault-secret" {
      + access_policy              = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = null
              + object_id               = "d6bb8ebd-cbb2-49e0-bc94-5be1e6ceb048"
              + secret_permissions      = [
                  + "set",
                  + "get",
                  + "delete",
                  + "list",
                  + "purge",
                  + "recover",
                  + "restore",
                ]
              + storage_permissions     = null
              + tenant_id               = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
            },
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = null
              + object_id               = (known after apply)
              + secret_permissions      = [
                  + "get",
                  + "list",
                ]
              + storage_permissions     = null
              + tenant_id               = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
            },
        ]
      + id                         = (known after apply)
      + location                   = "westeurope"
      + name                       = (known after apply)
      + purge_protection_enabled   = true
      + resource_group_name        = "nextcloud-resourcegroup"
      + sku_name                   = "standard"
      + soft_delete_enabled        = (known after apply)
      + soft_delete_retention_days = 90
      + tenant_id                  = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault.nc-vault-storage will be created
  + resource "azurerm_key_vault" "nc-vault-storage" {
      + access_policy              = [
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "get",
                  + "create",
                  + "delete",
                  + "list",
                  + "restore",
                  + "recover",
                  + "unwrapkey",
                  + "wrapkey",
                  + "purge",
                  + "encrypt",
                  + "decrypt",
                  + "sign",
                  + "verify",
                ]
              + object_id               = "d6bb8ebd-cbb2-49e0-bc94-5be1e6ceb048"
              + secret_permissions      = null
              + storage_permissions     = null
              + tenant_id               = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
            },
          + {
              + application_id          = null
              + certificate_permissions = null
              + key_permissions         = [
                  + "get",
                  + "create",
                  + "list",
                  + "restore",
                  + "recover",
                  + "unwrapkey",
                  + "wrapkey",
                  + "encrypt",
                  + "decrypt",
                  + "sign",
                  + "verify",
                ]
              + object_id               = (known after apply)
              + secret_permissions      = null
              + storage_permissions     = null
              + tenant_id               = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
            },
        ]
      + id                         = (known after apply)
      + location                   = "westeurope"
      + name                       = (known after apply)
      + purge_protection_enabled   = true
      + resource_group_name        = "nextcloud-resourcegroup"
      + sku_name                   = "standard"
      + soft_delete_enabled        = (known after apply)
      + soft_delete_retention_days = 90
      + tenant_id                  = "652cd9d3-c815-49d4-87d2-bb519a1341a4"
      + vault_uri                  = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # azurerm_key_vault_access_policy.nc-vault-disk-access-disk will be created
  + resource "azurerm_key_vault_access_policy" "nc-vault-disk-access-disk" {
      + id              = (known after apply)
      + key_permissions = [
          + "get",
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
          + "unwrapKey",
        ]
      + key_vault_id    = (known after apply)
      + object_id       = (known after apply)
      + tenant_id       = (known after apply)
    }

  # azurerm_key_vault_key.nc-disk-key will be created
  + resource "azurerm_key_vault_key" "nc-disk-key" {
      + curve          = (known after apply)
      + e              = (known after apply)
      + id             = (known after apply)
      + key_opts       = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size       = 2048
      + key_type       = "RSA"
      + key_vault_id   = (known after apply)
      + n              = (known after apply)
      + name           = "nextcloud-disk-key"
      + version        = (known after apply)
      + versionless_id = (known after apply)
      + x              = (known after apply)
      + y              = (known after apply)
    }

  # azurerm_key_vault_key.nc-storage-key will be created
  + resource "azurerm_key_vault_key" "nc-storage-key" {
      + curve          = (known after apply)
      + e              = (known after apply)
      + id             = (known after apply)
      + key_opts       = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size       = 2048
      + key_type       = "RSA"
      + key_vault_id   = (known after apply)
      + n              = (known after apply)
      + name           = "nextcloud-storage-key"
      + version        = (known after apply)
      + versionless_id = (known after apply)
      + x              = (known after apply)
      + y              = (known after apply)
    }

  # azurerm_key_vault_secret.nc-admin-secret will be created
  + resource "azurerm_key_vault_secret" "nc-admin-secret" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "nextcloud-admin-secret"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.nc-db-secret will be created
  + resource "azurerm_key_vault_secret" "nc-db-secret" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "nextcloud-db-secret"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.nc-oo-secret will be created
  + resource "azurerm_key_vault_secret" "nc-oo-secret" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "nextcloud-oo-secret"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.nc-storage-secret will be created
  + resource "azurerm_key_vault_secret" "nc-storage-secret" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = "nextcloud-storage-secret"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_linux_virtual_machine.nc-instance will be created
  + resource "azurerm_linux_virtual_machine" "nc-instance" {
      + admin_username                  = "ubuntu"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + custom_data                     = (sensitive value)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "nextcloud-instance"
      + network_interface_ids           = (known after apply)
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "nextcloud-resourcegroup"
      + size                            = "Standard_B1s"
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_encryption_set_id    = (known after apply)
          + disk_size_gb              = 64
          + name                      = (known after apply)
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18_04-lts-gen2"
          + version   = "18.04.202107200"
        }
    }

  # azurerm_network_interface.nc-net-interface will be created
  + resource "azurerm_network_interface" "nc-net-interface" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "nextcloud-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "nextcloud-resourcegroup"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "nextcloud-ipconf"
          + primary                       = true
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_security_group.nc-net-sec will be created
  + resource "azurerm_network_security_group" "nc-net-sec" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "nextcloud-net-sec"
      + resource_group_name = "nextcloud-resourcegroup"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.nc-net-rule-https will be created
  + resource "azurerm_network_security_rule" "nc-net-rule-https" {
      + access                       = "Allow"
      + destination_address_prefixes = [
          + "10.10.10.0/26",
        ]
      + destination_port_range       = "443"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nextcloud-net-rule-https"
      + network_security_group_name  = "nextcloud-net-sec"
      + priority                     = 101
      + protocol                     = "Tcp"
      + resource_group_name          = "nextcloud-resourcegroup"
      + source_address_prefix        = (sensitive)
      + source_port_range            = "*"
    }

  # azurerm_network_security_rule.nc-net-rule-httpsoo will be created
  + resource "azurerm_network_security_rule" "nc-net-rule-httpsoo" {
      + access                       = "Allow"
      + destination_address_prefixes = [
          + "10.10.10.0/26",
        ]
      + destination_port_range       = "8443"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nextcloud-net-rule-httpsoo"
      + network_security_group_name  = "nextcloud-net-sec"
      + priority                     = 102
      + protocol                     = "Tcp"
      + resource_group_name          = "nextcloud-resourcegroup"
      + source_address_prefix        = (sensitive)
      + source_port_range            = "*"
    }

  # azurerm_network_security_rule.nc-net-rule-selfhttps will be created
  + resource "azurerm_network_security_rule" "nc-net-rule-selfhttps" {
      + access                       = "Allow"
      + destination_address_prefixes = [
          + "10.10.10.0/26",
        ]
      + destination_port_range       = "443"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nextcloud-net-rule-selfhttps"
      + network_security_group_name  = "nextcloud-net-sec"
      + priority                     = 103
      + protocol                     = "Tcp"
      + resource_group_name          = "nextcloud-resourcegroup"
      + source_address_prefix        = (known after apply)
      + source_port_range            = "*"
    }

  # azurerm_network_security_rule.nc-net-rule-selfhttpsoo will be created
  + resource "azurerm_network_security_rule" "nc-net-rule-selfhttpsoo" {
      + access                       = "Allow"
      + destination_address_prefixes = [
          + "10.10.10.0/26",
        ]
      + destination_port_range       = "8443"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nextcloud-net-rule-selfhttpsoo"
      + network_security_group_name  = "nextcloud-net-sec"
      + priority                     = 104
      + protocol                     = "Tcp"
      + resource_group_name          = "nextcloud-resourcegroup"
      + source_address_prefix        = (known after apply)
      + source_port_range            = "*"
    }

  # azurerm_network_security_rule.nc-net-rule-ssh will be created
  + resource "azurerm_network_security_rule" "nc-net-rule-ssh" {
      + access                       = "Allow"
      + destination_address_prefixes = [
          + "10.10.10.0/26",
        ]
      + destination_port_range       = "22"
      + direction                    = "Inbound"
      + id                           = (known after apply)
      + name                         = "nextcloud-net-rule-ssh"
      + network_security_group_name  = "nextcloud-net-sec"
      + priority                     = 100
      + protocol                     = "Tcp"
      + resource_group_name          = "nextcloud-resourcegroup"
      + source_address_prefix        = (sensitive)
      + source_port_range            = "*"
    }

  # azurerm_public_ip.nc-public-ip will be created
  + resource "azurerm_public_ip" "nc-public-ip" {
      + allocation_method       = "Static"
      + availability_zone       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "nextcloud-public-ip"
      + resource_group_name     = "nextcloud-resourcegroup"
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + zones                   = (known after apply)
    }

  # azurerm_resource_group.nc-resourcegroup will be created
  + resource "azurerm_resource_group" "nc-resourcegroup" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "nextcloud-resourcegroup"
    }

  # azurerm_role_assignment.nc-instance-role-assignment will be created
  + resource "azurerm_role_assignment" "nc-instance-role-assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/e7edbc92-e4b8-4153-a444-1e33f3978689"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_definition.nc-instance-role will be created
  + resource "azurerm_role_definition" "nc-instance-role" {
      + assignable_scopes           = [
          + "/subscriptions/e7edbc92-e4b8-4153-a444-1e33f3978689",
        ]
      + id                          = (known after apply)
      + name                        = (known after apply)
      + role_definition_id          = (known after apply)
      + role_definition_resource_id = (known after apply)
      + scope                       = "/subscriptions/e7edbc92-e4b8-4153-a444-1e33f3978689"

      + permissions {
          + actions      = [
              + "Microsoft.KeyVault/vaults/secrets/read",
              + "Microsoft.Storage/storageAccounts/blobServices/containers/read",
              + "Microsoft.Storage/storageAccounts/listKeys/action",
              + "Microsoft.Storage/storageAccounts/read",
            ]
          + data_actions = [
              + "Microsoft.KeyVault/vaults/secrets/getSecret/action",
            ]
        }
    }

  # azurerm_storage_account.nc-storage-account will be created
  + resource "azurerm_storage_account" "nc-storage-account" {
      + access_tier                      = "Hot"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "westeurope"
      + min_tls_version                  = "TLS1_2"
      + name                             = (known after apply)
      + nfsv3_enabled                    = false
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = "nextcloud-resourcegroup"
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + shared_access_key_enabled        = true

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # azurerm_storage_account_customer_managed_key.nc-storage-cmk will be created
  + resource "azurerm_storage_account_customer_managed_key" "nc-storage-cmk" {
      + id                 = (known after apply)
      + key_name           = "nextcloud-storage-key"
      + key_vault_id       = (known after apply)
      + storage_account_id = (known after apply)
    }

  # azurerm_storage_container.nc-storage-container will be created
  + resource "azurerm_storage_container" "nc-storage-container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "nextcloud-storage-container"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # azurerm_storage_container.nc-storage-container-data will be created
  + resource "azurerm_storage_container" "nc-storage-container-data" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "nextcloud-storage-container-data"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = (known after apply)
    }

  # azurerm_subnet.nc-subnet will be created
  + resource "azurerm_subnet" "nc-subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.10.10.0/26",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "nextcloud-subnet"
      + resource_group_name                            = "nextcloud-resourcegroup"
      + virtual_network_name                           = "nextcloud-network"
    }

  # azurerm_subnet_network_security_group_association.nc-net-sec-assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "nc-net-sec-assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_user_assigned_identity.nc-instance-id will be created
  + resource "azurerm_user_assigned_identity" "nc-instance-id" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "nextcloud-resourcegroup"
      + tenant_id           = (known after apply)
    }

  # azurerm_virtual_network.nc-network will be created
  + resource "azurerm_virtual_network" "nc-network" {
      + address_space         = [
          + "10.10.10.0/24",
        ]
      + dns_servers           = (known after apply)
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "nextcloud-network"
      + resource_group_name   = "nextcloud-resourcegroup"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

  # random_password.admin_password will be created
  + resource "random_password" "admin_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.db_password will be created
  + resource "random_password" "db_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_password.oo_password will be created
  + resource "random_password" "oo_password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # random_string.nc-random will be created
  + resource "random_string" "nc-random" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # random_uuid.nc-instance-role-uuid will be created
  + resource "random_uuid" "nc-instance-role-uuid" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # time_sleep.wait_for_vaults will be created
  + resource "time_sleep" "wait_for_vaults" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + nc-output = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: `@JCZuurmond`, Action: `pull_request`, Working Directory: `azure/`, Workflow: `Terraform Plan`*